// 向浏览器控制台输出信息

// path: js\console.js

// 使用严格模式
"use strict";
// 定义一个文字构成的图像，该图像是英文字母“L”
let imageL = [
    " #       ",
    " #       ",
    " #       ",
    " #       ",
    " #       ",
    " #       ",
    " #       ",
    " #       ",
    " ####### ",
    "         "
];
// 定义一个文字构成的图像，该图像是英文字母“Z”
let imageZ = [
    " ####### ",
    "       # ",
    "      #  ",
    "     #   ",
    "    #    ",
    "   #     ",
    "  #      ",
    " #       ",
    " ####### ",
    "         "
];
// 定义一个文字构成的图像，该图像是英文字母“C”
let imageC = [
    "   ####  ",
    "  #    # ",
    " #       ",
    " #       ",
    " #       ",
    " #       ",
    " #       ",
    "  #    # ",
    "   ####  ",
    "         "
];
// // 先输出1个空行
// console.log('');
// // 并排输出图像
// for (let i = 0; i < imageL.length; i++) {
//     console.log(imageL[i] + imageZ[i] + imageC[i]);
// }
// 输出信息
// console.log('Hello World!');

let imageBloody = [
    '██▓    ▒███████▒ ▄████▄',
    '▓██▒    ▒ ▒ ▒ ▄▀░▒██▀ ▀█',
    '▒██░    ░ ▒ ▄▀▒░ ▒▓█    ▄',
    '▒██░      ▄▀▒   ░▒▓▓▄ ▄██▒',
    '░██████▒▒███████▒▒ ▓███▀ ░',
    '░ ▒░▓  ░░▒▒ ▓░▒░▒░ ░▒ ▒  ░',
    '░ ░ ▒  ░░░▒ ▒ ░ ▒  ░  ▒',
    '░ ░   ░ ░ ░ ░ ░░',
    '░  ░  ░ ░    ░ ░',
];
console.log(imageBloody.join('\n'));

let image_ANSI_shadow = [
    '██╗     ███████╗ ██████╗',
    '██║     ╚══███╔╝██╔════╝',
    '██║       ███╔╝ ██║',
    '██║      ███╔╝  ██║',
    '███████╗███████╗╚██████╗',
    '╚══════╝╚══════╝ ╚═════╝',
];
console.log(image_ANSI_shadow.join('\n'));